# frozen_string_literal: true

# Make sure you have following env variables
# when using this Brewfile
#
#  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

# Essential terminal utilities
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'jonof/kenutils'
tap 'heroku/brew'
tap 'puma/puma'

brew 'advancecomp'
brew 'ansible'
brew 'autoconf'
brew 'curl-openssl'
brew 'emojify'
brew 'geckodriver'
brew 'gifsicle'
brew 'git'
brew 'gnupg'
brew 'gnu-sed'
brew 'pinentry-mac'
brew 'graphviz'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jhead'
brew 'jonof/kenutils/pngout'
brew 'jpeg'
brew 'jpegoptim'
brew 'less'
brew 'libevent'
brew 'libtool'
brew 'libyaml'
brew 'mackup'
brew 'mysql', restart_service: true
brew 'optipng'
brew 'overmind'
brew 'perl'
brew 'pngcrush'
brew 'pngquant'
brew 'postgresql'
brew 'qt'
brew 'redis', restart_service: true
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'puma-dev'
brew 'bat'
brew 'up'
brew 'exa'
# Essential Mac applications
# --- BASIC TOOLS ---
cask 'alfred3'
cask 'iterm2'
cask 'dropbox'
cask 'karabiner-elements'
cask 'keka'
cask 'keybase'
cask 'ngrok'
cask 'sequel-pro'
cask 'psequel'
cask 'resilio-sync'
cask 'flux'
# --- FONTS ---
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-hack-nerd-font'
cask 'font-public-sans'
cask 'font-jetbrainsmono-nerd-font'
# --- BROWSERS ---
cask 'google-chrome'
cask 'firefox-developer-edition'
cask 'welly'
cask 'docker'
# --- Dev TOOLS ---
cask 'visual-studio-code'
cask 'fork'
cask 'imageoptim'
cask 'insomnia'
cask 'postman'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox' # something wrong with promission
cask 'xquartz'
cask 'sketch'
cask 'boostnote'
# --- Communication ---
cask 'slack'
# --- Applications ---
cask 'calibre'           # e-books
cask 'sigil'             # e-books
cask 'spotify'
cask 'subler'
cask 'transmission'
cask 'geotag-photos-pro'
cask 'openemu'

mas 'Keynote', id: 409_183_694
mas 'Pages', id: 409_201_541
mas 'Numbers', id: 409_203_825
mas '1Password', id: 443_987_910
mas 'OpenConv', id: 892_308_325
mas 'Hidden Bar', id: 1_452_453_066
mas 'iStat Menus', id: 1_319_778_037
mas 'Byword', id: 420_212_497
mas 'Spark', id: 1_176_895_641
mas 'Moom', id: 419_330_170
mas 'LINE', id: 539_883_307
mas 'SnippetsLab', id: 1_006_087_419
